app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
 if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "name" = ?, "price" = ?, "description" = ?, "updated_at" = ?, "image_file_name" = ?, "capacity" = ? WHERE "movies"."id" = ?  [["name", "Avatar"], ["price", 62], ["description", "experiment turns reality"], ["updated_at", "2022-10-11 13:43:00.448524"], ["image_file_name", "avater.png"], ["capacity", 69], ["id", 9]]

 def create
    @movie = Movie.new(movie_params)
  if @movie.save
---
INSERT INTO "movies" ("name", "price", "description", "starts_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dracular dd22"], ["price", 7], ["description", "rdghbnh"], ["starts_at", nil], ["created_at", "2022-10-10 22:11:59.060788"], ["updated_at", "2022-10-10 22:11:59.060788"]]