app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (starts_at > '2022-10-11 00:57:20.606365' ) ORDER BY starts_at
---
    def index
      @movies = Movie.all